TestCase/sineWave/04-sineWave-nork4-hisa-NSCBC/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            uniformFixedValue;
        uniformValue    sine;
        uniformValueCoeffs
        {
            frequency       constant 3000;
            scale           constant 50;
            level           constant 101325;
        }
        value           $internalField;
    }

    outlet
    {
        type characteristicVelocityInletOutletPressure;
        //type characteristicFarfieldPressure;
        U (0 0 0);
        p 101325;
        T 300;
        value $internalField;
//        type            waveTransmissive;
//        gamma           1.4;
//        fieldInf        101325;
//        lInf            2.25;
//        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
